---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.CableTraySettings
source: html/4493b6ee-e87d-ca33-011b-967c56978ccb.htm
---
# CableTraySettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.